IdeaRS.OpenModel.Geometry2D.ArcSegment2D
Represents an arc segment in two-dimensional space.

IdeaRS.OpenModel.Geometry2D.ArcSegment2D.Point
Gets or sets the point of circular arc somewhere between start and end point.